{
  "architectures": [
    "ColLFM2"
  ],
  "model_type": "collfm2",
  "base_model": "LiquidAI/LFM2-VL-450M",
  "dim": 128,
  "mask_non_image_embeddings": false,
  "_name_or_path": "VAGOsolutions/SauerkrautLM-ColLFM2-450M-v0.1",
  "hidden_size": 1024
}