Repository: pypi-data/pypi-mirror-399
Catalog: packages/hrendjango-auth-plus/hrendjango_auth_plus-0.1.0-py3-none-any.whl/auth_plus/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Avatar
ru: Фото профиля

source: Birth Date
ru: Дата рождения

source: Gender
ru: Пол

source: Email verified
ru: Электронная почта подтверждена

source: Two-factor authentication is enabled by email
ru: Включена двухэтапная аутентификация по адресу электронной почты

source: Two-factor authentication is enabled by TOTP
ru: Включена двухэтапная аутентификация по TOTP

source: Two-factor authentication is enabled by recovery code
ru: Включена двухэтапная аутентификация по коду восстановления

source: Username or email
ru: Имя пользователя или адрес электронной почты

source: An account with this email already exists
ru: Учетная запись с этим адресом электронной почты уже существует

source: The passwords do not match
ru: Пароли не совпадают

source: Verification code
ru: Код подтверждения

source: Log in after resetting your password
ru: Авторизоваться после сброса пароля

source: Enter the confirmation code
ru: Введите код подтверждения

source: Invalid or outdated verification code
ru: Неверный или устаревший код подтверждения

source: Change user settings
ru: Изменить настройки пользователя

source: Old password is incorrect
ru: Старый пароль неверен

source: Password reset
ru: Сброс пароля

source: User with this email not found
ru: Пользователь с таким email не найден

source: Session expired, please start resetting your password again
ru: Сессия истекла, начните сброс пароля заново

source: The code has expired
ru: Срок действия кода истёк

source: Invalid verification code
ru: Неверный код подтверждения

source: Create a new password
ru: Создание нового пароля

source: User does not exist
ru: Пользователя не существует

source: The code has already been used or has expired
ru: Код уже использован или его срок действия истек

source: Password reset error
ru: Ошибка сброса пароля

source: Password is changed
ru: Пароль изменен

source: Sign in confirmation
ru: Подтверждение входа в аккаунт
