{
  "</s>": 3,
  "<mask>": 4,
  "<pad>": 1,
  "<s>": 2,
  "<unk>": 0,
  "A": 5,
  "AcademyĠo": 6,
  "C": 7,
  "Chronicle": 8,
  "I": 9,
  "N": 10,
  "NationalĠ": 11,
  "NationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠ": 12,
  "NationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠ": 13,
  "NationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠo": 14,
  "NationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠ": 15,
  "S": 16,
  "SciencesĠ": 17,
  "T": 18,
  "TheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠThe": 19,
  "TheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 20,
  "V": 21,
  "ValkyriaĠ": 22,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠ": 23,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠ": 24,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 25,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 26,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 27,
  "a": 28,
  "aaaa": 29,
  "aaaaaaaaa": 30,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa": 31,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa": 32,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa": 33,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠ": 34,
  "aaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa": 35,
  "b": 36,
  "c": 37,
  "d": 38,
  "e": 39,
  "f": 40,
  "g": 41,
  "h": 42,
  "i": 43,
  "j": 44,
  "k": 45,
  "l": 46,
  "lazyĠdogĠ": 47,
  "m": 48,
  "n": 49,
  "o": 50,
  "p": 51,
  "q": 52,
  "r": 53,
  "rownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 54,
  "s": 55,
  "t": 56,
  "u": 57,
  "v": 58,
  "verĠtheĠlazyĠdogĠ": 59,
  "w": 60,
  "x": 61,
  "xĠjumpsĠo": 62,
  "y": 63,
  "z": 64,
  "Ġ": 65,
  "ĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 66,
  "ĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 67
}
