{
  "</s>": 3,
  "<mask>": 4,
  "<pad>": 1,
  "<s>": 2,
  "<unk>": 0,
  "A": 5,
  "C": 6,
  "I": 7,
  "N": 8,
  "NationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠ": 9,
  "S": 10,
  "T": 11,
  "TheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 12,
  "TheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠTheĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 13,
  "V": 14,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 15,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 16,
  "ValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 17,
  "a": 18,
  "aaaaaa": 19,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa": 20,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠ": 21,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠ": 22,
  "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaĠ": 23,
  "b": 24,
  "c": 25,
  "d": 26,
  "e": 27,
  "f": 28,
  "g": 29,
  "h": 30,
  "heĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠThe": 31,
  "i": 32,
  "j": 33,
  "k": 34,
  "l": 35,
  "lkyria": 36,
  "lkyriaĠChroniclesĠIIIĠValkyriaĠChroniclesĠIIIĠ": 37,
  "m": 38,
  "n": 39,
  "o": 40,
  "p": 41,
  "q": 42,
  "r": 43,
  "s": 44,
  "t": 45,
  "tional": 46,
  "tionalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠ": 47,
  "tionalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNa": 48,
  "tionalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNationalĠAcademyĠofĠSciencesĠNa": 49,
  "u": 50,
  "v": 51,
  "w": 52,
  "x": 53,
  "y": 54,
  "z": 55,
  "Ġ": 56,
  "ĠAcade": 57,
  "ĠAcademyĠofĠSciencesĠ": 58,
  "ĠChron": 59,
  "ĠChronicles": 60,
  "ĠChroniclesĠIIIĠ": 61,
  "ĠofĠSc": 62,
  "ĠofĠScience": 63,
  "Ġquick": 64,
  "ĠquickĠbrow": 65,
  "ĠquickĠbrownĠfox": 66,
  "ĠquickĠbrownĠfoxĠjump": 67,
  "ĠquickĠbrownĠfoxĠjumpsĠove": 68,
  "ĠquickĠbrownĠfoxĠjumpsĠoverĠtheĠlazyĠdogĠ": 69,
  "ĠtheĠl": 70,
  "ĠtheĠlazyĠd": 71
}
